export default {
  common: {
    paymentRedirect: 'Перенаправлення платежу',
    redirectingInSeconds: 'Перенаправлення через {{count}} с...'
  },
  withdrawal: {
    initializing: 'Ініціалізація виведення...',
    noRedirect: 'URL для перенаправлення не отримано',
    errorWithMessage: 'Помилка під час запуску виведення. {{message}}. Зверніться до підтримки.'
  },
  form: {
    selectCountry: 'Виберіть країну',
    country: 'Країна',
    firstName: 'Ім’я',
    lastName: 'Прізвище',
    dob: 'Дата народження',
    email: 'Електронна пошта',
    phone: 'Телефон',
    postalCode: 'Поштовий індекс',
    stateProvince: 'Штат/Провінція',
    city: 'Місто',
    address: 'Адреса',
    submit: 'Надіслати',
    submitting: 'Надсилання...',
    phonePlaceholder: 'напр. 201112222',
    statePlaceholder: 'напр. CA, NY, JS',
    submitSuccess: 'Форму успішно надіслано!',
    submitError: 'Помилка під час надсилання форми. Спробуйте ще раз.'
  },
  validation: {
    'country.required': 'Країна є обов’язковою',
    'first_name.required': 'Ім’я є обов’язковим',
    'first_name.max': 'Ім’я має містити не більше 25 символів',
    'last_name.required': 'Прізвище є обов’язковим',
    'last_name.max': 'Прізвище має містити не більше 25 символів',
    'dob.required': 'Дата народження є обов’язковою',
    'dob.range': 'Введіть дійсну дату між 1900 роком і сьогодні',
    'email.required': 'Електронна пошта є обов’язковою',
    'email.max': 'Електронна пошта має містити не більше 50 символів',
    'email.format': 'Введіть дійсну адресу електронної пошти',
    'phone.required': 'Номер телефону є обов’язковим',
    'phone.format': 'Введіть дійсний номер телефону (лише цифри, без коду країни)',
    'zip.required': 'Поштовий індекс є обов’язковим',
    'zip.format': 'Поштовий індекс має бути буквено-цифровим і до 12 символів',
    'state.format': 'Штат/Провінція має складатися з 2–3 літер (формат ISO)',
    'state.required_for_country': 'Для США, Канади та Австралії поле Штат/Провінція обов’язкове',
    'city.required': 'Місто є обов’язковим',
    'city.max': 'Місто має містити не більше 50 символів',
    'address.required': 'Адреса є обов’язковою',
    'address.max': 'Адреса має містити не більше 100 символів'
  }
}
